# Technique 2: Ordinal Number Encoding

ordinal numbers are data to which we can assign a rank (One after the other )

In [ ]:
import datetime

In [ ]:
today_date=datetime.datetime.today()
today_date

datetime.datetime(2020, 9, 3, 9, 22, 39, 843392)

In [ ]:
# If we want all the data if date time betwwon today and last 15 days we can use timedelta ,shown below
datetime.datetime.today()-datetime.timedelta(3)

datetime.datetime(2020, 8, 31, 9, 22, 42, 545440)

In [ ]:
# geting all the 15 day date time from todat using list comprehension
day=[datetime.datetime.today()-datetime.timedelta(x) for x in range(0,15)]

In [ ]:
# converting days into data frame using pandas
import pandas as pd
data=pd.DataFrame(day)
data.columns=["Day"]
data.head()

                         Day
0 2020-09-03 09:22:46.061929
1 2020-09-02 09:22:46.061943
2 2020-09-01 09:22:46.061946
3 2020-08-31 09:22:46.061948
4 2020-08-30 09:22:46.061950

In [ ]:
# now getting week day from using dt datetime python library
data['weekday']=data["Day"].dt.strftime("%A")
data.head(10)

                         Day    weekday
0 2020-09-03 09:22:46.061929   Thursday
1 2020-09-02 09:22:46.061943  Wednesday
2 2020-09-01 09:22:46.061946    Tuesday
3 2020-08-31 09:22:46.061948     Monday
4 2020-08-30 09:22:46.061950     Sunday
5 2020-08-29 09:22:46.061953   Saturday
6 2020-08-28 09:22:46.061954     Friday
7 2020-08-27 09:22:46.061956   Thursday
8 2020-08-26 09:22:46.061958  Wednesday
9 2020-08-25 09:22:46.061960    Tuesday

In [ ]:
dictionary ={"Monday":1,"Tuesday":2,"Wednesday":3,"Thursday":4,"Friday":5,"Saturday":6,"Sunday":7}

In [ ]:
# now mapping the key with the values assigned in dictionary to weekday feature 
# Monday will be replaced by number 1 
data["weekday"].map(dictionary)
data["weekday_ordinal"]=data["weekday"].map(dictionary)
data.head()

                         Day    weekday  weekday_ordinal
0 2020-09-03 09:22:46.061929   Thursday                4
1 2020-09-02 09:22:46.061943  Wednesday                3
2 2020-09-01 09:22:46.061946    Tuesday                2
3 2020-08-31 09:22:46.061948     Monday                1
4 2020-08-30 09:22:46.061950     Sunday                7

# Technique 3: Count or Frequency Encoding

In [ ]:
train_set=pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",header=None,index_col=None)
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [ ]:
train_set=train_set[[1,3,5,6,7,8,9,13]]
train_set

                      1            3   ...       9               13
0              State-gov    Bachelors  ...     Male   United-States
1       Self-emp-not-inc    Bachelors  ...     Male   United-States
2                Private      HS-grad  ...     Male   United-States
3                Private         11th  ...     Male   United-States
4                Private    Bachelors  ...   Female            Cuba
...                  ...          ...  ...      ...             ...
32556            Private   Assoc-acdm  ...   Female   United-States
32557            Private      HS-grad  ...     Male   United-States
32558            Private      HS-grad  ...   Female   United-States
32559            Private      HS-grad  ...     Male   United-States
32560       Self-emp-inc      HS-grad  ...   Female   United-States

[32561 rows x 8 columns]

In [ ]:
train_set.columns=["Employment","Degree","Status","Designation","family-job","Race",'Sex',"Country"]
train_set.head()

          Employment      Degree  ...      Sex         Country
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [ ]:
# checking all the count of unique categories present in each feature using for loop
for feature in train_set.columns[:]:
  print(feature,":",len(train_set[feature].unique()),"labels")

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family-job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [ ]:
# Performing Count or Frequency Encoding (Replacing the categories with the values or the counts for each categories)
# Eg United-States will be replaced with  29170 , mexico with 643 (whatever the count is present for each category)

country_map=train_set["Country"].value_counts().to_dict()

In [ ]:
train_set["Country"]=train_set["Country"].map(country_map)
train_set.head()

          Employment      Degree               Status  ...    Race      Sex Country
0          State-gov   Bachelors        Never-married  ...   White     Male   29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   29170
2            Private     HS-grad             Divorced  ...   White     Male   29170
3            Private        11th   Married-civ-spouse  ...   Black     Male   29170
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female      95

[5 rows x 8 columns]

Advantages and Disadvantages of Count or Frequency Encoding

Advantages
1) Easy to use
2) Not increasing feature space

Disadvantages
1) It will provide same weight if frequencies are same ,wont be able to handle categories with same frequencies

# Technique 4 : Target Guided Ordinal Encoding

In this we will 1) ordering the labels according to target
2) Replace the labels by the joint probability of being 1 o

In [ ]:
import pandas as pd
df=pd.read_csv("titanic.csv",usecols=["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [ ]:
df["Cabin"].fillna("Missing",inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [ ]:
# converting column to str and Taking first letter of the string and using as catgeory for the cabin feature
df["Cabin"]=df["Cabin"].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [ ]:
# using groupby function to check survival percentage based on cabin
df.groupby(df["Cabin"])["Survived"].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [ ]:
# sorting and then getting the index (Cabin)
df.groupby(df["Cabin"])["Survived"].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [ ]:
ordinal_labels=df.groupby(df["Cabin"])["Survived"].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [ ]:
# now assigning rank to ordinal_values using dictionary
ordinal={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [ ]:
df["Cabin_ordinal_labels"]=df["Cabin"].map(ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

# Technique 5 : Mean Encoding 
 Replacing the categories with its mean value

In [ ]:
mean_ordinal=df.groupby(df["Cabin"])["Survived"].mean().to_dict()

In [ ]:
df["Mean_ordinal_encode"]=df["Cabin"].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  Mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

Dsiadvantage = 1) It leads to overfitting

Technique 6 : Probability Ratio Encoding

In [ ]:
import pandas as pd
df=pd.read_csv("titanic.csv",usecols=["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [ ]:
df["Cabin"].fillna("Missing",inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [ ]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [ ]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [ ]:
# Now performing Probability Ratio Encoding on the feature
prob_df=df.groupby(["Cabin"])["Survived"].mean()
prob_df

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [ ]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [ ]:
prob_df["Died"]=1-prob_df["Survived"]
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [ ]:
prob_df["Probability_ratio"]=prob_df["Survived"]/prob_df["Died"]
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [ ]:
probability_encoded=prob_df["Probability_ratio"].to_dict()

In [ ]:
df["Cabin_encoded"]=df["Cabin"].map(probability_encoded)
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274